[{"start_min": "0:44", "start_sec": 44.859, "value": "Differential equations arise whenever it’s\neasier to describe change than absolute amounts.It’s easier to say why population sizes\ngrow or shrink than it is to describe why"}, {"start_min": "1:20", "start_sec": 80.82, "value": "functions with a single input, often thought\nof as time, and Partial differential equations,or PDEs, dealing with functions that have\nmultiple inputs. Partial derivatives are something"}, {"start_min": "1:42", "start_sec": 102.47, "value": "body, or the velocity of a fluid at every\npoint in space. Ordinary differential equations,our focus for now, involve only a finite collection\nof values changing with time."}, {"start_min": "2:47", "start_sec": 167.239, "value": "This gives an example of a differential equation,\nalbeit a relatively simple one. Focus on they-coordinate, as a function of time. It’s\nderivative gives the vertical component of"}, {"start_min": "2:59", "start_sec": 179.629, "value": "let’s write this first derivative as y-dot,\nand the second derivative as y-double-dot."}, {"start_min": "4:19", "start_sec": 259.13, "value": "is. For example, studying the motion of planets,\nstars and moons, gravity can no longer beconsidered a constant. Given two bodies, the\npull on one is in the direction of the other,"}, {"start_min": "9:23", "start_sec": 563.5, "value": "If that sounds odd, consider the fact that\nhere, the sine function takes theta as aninput, but the approximate solution has the\nvalue theta itself oscillating as a sine wave."}, {"start_min": "10:50", "start_sec": 650.62, "value": "the actual solution part, and go straight\nto building understanding and making computationsfrom the equations alone. Let me walk through\nwhat that might look like with the Pendulum."}, {"start_min": "12:38", "start_sec": 758.33, "value": "the pendulum moves faster in the leftward\ndirection as it approaches the bottom. Keepin mind, even though the velocity vector on\nthis pendulum is pointed to the left, the"}, {"start_min": "13:26", "start_sec": 806.24, "value": "With this space, we can visualize a differential\nequation as a vector field. Here, let me showyou what I mean."}, {"start_min": "14:57", "start_sec": 897.12, "value": "Notice that we’ve effectively broken up\na single second order equation into a systemof two first order equations. You might even\ngive theta-dot a different name to emphasize"}, {"start_min": "15:26", "start_sec": 926.06, "value": "In this form, we have a nice visual way to\nthink about what solving our equation means:As our system evolves from some initial state,\nour point in this space will move along some"}, {"start_min": "16:57", "start_sec": 1017.03, "value": "the value of mu means the system tends towards\nsome attracting state faster, so getting somesoftware to draw these vector fields for you\ncan be a great way to gain an intuition for"}, {"start_min": "17:04", "start_sec": 1024.12, "value": ""}, {"start_min": "19:47", "start_sec": 1187.14, "value": "To take one example of why phase flow is a\nfruitful formulation, the origin of our spacecorresponds to the pendulum standing still;\nand so does this point over here, representing"}, {"start_min": "20:10", "start_sec": 1210.86, "value": "system result in a state that tends back towards\nthe stable point or away from it. Physicalintuition for the pendulum makes the answer\nhere obvious, but how would you think about"}, {"start_min": "20:45", "start_sec": 1245.63, "value": "Speaking of attraction and stability, let’s\ntake a brief sidestep to talk about love.The Strogatz quote I referenced earlier comes\nfrom a whimsical column in the New York Times"}, {"start_min": "20:50", "start_sec": 1250.59, "value": ""}, {"start_min": "23:14", "start_sec": 1394.4, "value": "The basic idea is that if you’re at some\npoint on this phase diagram, take a step basedon whatever vector your sitting on for some\nsmall time step, delta-t. Specifically, take"}, {"start_min": "24:05", "start_sec": 1445.92, "value": "this case, computing theta(10) requires a\nthousand little steps. Luckily, we live ina world with computers, so repeating a simple\ntask 1,000 times is as simple as articulating"}, {"start_min": "24:19", "start_sec": 1459.77, "value": "In fact, let’s write a little python program\nthat computes theta(t) for us. It will makeuse of the differential equation, which returns\nthe second derivative of theta as a function"}, {"start_min": "26:12", "start_sec": 1572.75, "value": "to the initial conditions, say the kind due\nto necessarily imperfect measurements, resultin wildly different trajectories. We’ve\neven built some good understanding for why"}]